backend/app/executers/offer_executer.rb

  def paginated(page= 1)
    page ||= 1
    paginatedOffers = Offer.limit(15).offset((page.to_i-1) * 15)
    @response[:offers] = get_serlized_array(paginatedOffers)
    @response[:page] = page
    @response[:total] = Offer.count
---
SELECT "offers".* FROM "offers" WHERE (departement_name = 'sad') AND (promotion_active = 'dsa')
SELECT COUNT(*) FROM "offers"